import operator


JOBS = {
    "Безробітний": 0,
    "Верт": 1,
    "Догмант": 2,
    "Дос'єр": 3
}

JOBS_REVERSED = {v: k for k, v in JOBS.items()}

STATUSES = {
    "❌ Відсторонений, не має впливу на Державу": 0,
    "🪆 Новачок, тільки приєднався до Держави!": 1,
    "🎗️ Середняк, розуміє головні Державні аспекти!": 2,
    "🎖️ Ветеран, знається на державі": 3
}

STATUSES_REVERSED = {v: k for k, v in STATUSES.items()}

SEX = {
    0: "Чоловік",
    1: "Жінка",
    2: "Гермафродит"
}

SEX_REVERSED = {v: k for k, v in SEX.items()}

ALLOWED_CHANGES = [
    "ім'я",
    "прізвище",
    "стать",
    "тег",
    "баланс",
    "статус",
    "громадянство",
    "робота",
    "емодзі",
    "дата_народження",
    "фото_паспорту",
    "репутація"
]

ALLOWED_DIPLOMA_CHANGES = [
    "ім'я",
    "призвище",
    "назва_академії",
    "дата_початку_навчання",
    "дата_закінчення_навчання",
    "середня_оцінка"
]

OPERATORS = {
    "+": operator.add,
    "-": operator.sub,
    "=": operator.eq,
}

CITIZENS = {
    0: "Негромадянин",
    1: "Громадянин"
}

KAVUNS = {
    0: "🍉 <b>Ви перемогли, ставку нараховано на ваш баланс!</b>",
    1: "🐖 <b>Свиня з‘їла ваші кавуни під час кидка, перекидайте!</b>",
    2: "🐖 <b>Ви програли, свиня опонента забрала вашу ставку!</b>"
}
